In [1]:
import pandas as pd

In [3]:
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]
})
countries_df

     country  population    square
0     Англия       56.29    133396
1     Канада       38.05   9984670
2        США      322.28   9826630
3     Россия      146.24  17125191
4    Украина       45.50    603628
5   Беларусь        9.50    207600
6  Казахстан       17.04   2724902

In [4]:
countries_df.index = ['UK', 'CA', 'US', 'RU', 'UA', 'BY', 'KZ']
display(countries_df)

      country  population    square
UK     Англия       56.29    133396
CA     Канада       38.05   9984670
US        США      322.28   9826630
RU     Россия      146.24  17125191
UA    Украина       45.50    603628
BY   Беларусь        9.50    207600
KZ  Казахстан       17.04   2724902

In [5]:
countries_df = pd.DataFrame(
    data = [
        ['Англия', 56.29, 133396],
        ['Канада', 38.05, 9984670],
        ['США', 322.28, 9826630],
        ['Россия', 146.24, 17125191],
        ['Украина', 45.5, 603628],
        ['Беларусь', 9.5, 207600],
        ['Казахстан', 17.04, 2724902]
    ],
    columns= ['country', 'population', 'square'],
    index = ['UK', 'CA', 'US', 'RU', 'UA', 'BY', 'KZ']
)
display(countries_df)

      country  population    square
UK     Англия       56.29    133396
CA     Канада       38.05   9984670
US        США      322.28   9826630
RU     Россия      146.24  17125191
UA    Украина       45.50    603628
BY   Беларусь        9.50    207600
KZ  Казахстан       17.04   2724902

In [23]:
display(countries_df.iloc[:,1:3].mean(axis=0))
print()
display(countries_df.iloc[:,1:3].mean(axis=1))

population    9.070000e+01
square        5.800860e+06
dtype: float64

UK      66726.145
CA    4992354.025
US    4913476.140
RU    8562668.620
UA     301836.750
BY     103804.750
KZ    1362459.520
dtype: float64

In [26]:
display(countries_df.population)
print()
display(countries_df['population'])
type(countries_df.population)

UK     56.29
CA     38.05
US    322.28
RU    146.24
UA     45.50
BY      9.50
KZ     17.04
Name: population, dtype: float64

UK     56.29
CA     38.05
US    322.28
RU    146.24
UA     45.50
BY      9.50
KZ     17.04
Name: population, dtype: float64

pandas.core.series.Series

In [45]:
display(countries_df.loc['UK', 'square'])
print()
display(countries_df.loc['RU', ['population', 'square']])
display(countries_df.loc[['UA', 'BY', 'KZ'],['population', 'square']])
display(countries_df.iloc[4:8, 1:3])
display(countries_df.loc['RU', 'population'] - countries_df.loc['RU', 'square'])

133396

population      146.24
square        17125191
Name: RU, dtype: object

    population   square
UA       45.50   603628
BY        9.50   207600
KZ       17.04  2724902

    population   square
UA       45.50   603628
BY        9.50   207600
KZ       17.04  2724902

-17125044.76

In [52]:
expenses = [156, 130, 270]
income = [478, 512, 196]
years = [2018, 2019, 2020]
def create_companyDF(income, expenses, years):
    df = pd.DataFrame({
        'income': income,
        'expenses': expenses,
    }, index=years)
    return df

arr = create_companyDF(income, expenses, years)
display(arr)

def get_profit(df, year):
    if year not in df.index:
        return None
    else:
        profit = df.loc[year, 'income'] - df.loc[year, 'expenses']
    return profit
display(get_profit(arr, 2054))

      income  expenses
2018     478       156
2019     512       130
2020     196       270

None

In [37]:

expenses = [156, 130, 270]
income = [478, 512, 196]
years = [2018, 2019, 2020]
def create_companyDF(income, expenses, years):
    """
    Создайте функцию create_companyDF(income, expenses, years), которая  возвращает DataFrame, 
    составленный из входных данных со столбцами “Income” и “Expenses” и индексами, соответствующим годам рассматриваемого периода.
    """
    df = pd.DataFrame({
        'income': income,
        'expenses': expenses,
    }, index=years)
    return df
display(create_companyDF(income, expenses, years))

(      income  expenses
 2018     478       156
 2019     512       130
 2020     196       270,
 Int64Index([2018, 2019, 2020], dtype='int64'))